
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	// Вставить содержимое обработчика.
	
	ТекПользователь = Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя());
//если не нашли – создадим нового
Если ТекПользователь.Пустая() Тогда
НовПользователь = Справочники.ФизическиеЛица.СоздатьЭлемент();
НовПользователь.Наименование = ИмяПользователя();
НовПользователь.Записать();
ТекПользователь = НовПользователь.Ссылка;
КонецЕсли;
//приваиваем параметру сеанса ТекущийПользователь ссылку на справчоник физ.лиц
ПараметрыСеанса.ТекущийПользователь = ТекПользователь;

КонецПроцедуры

