
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Объект.ТратыЗаТекущийМесяц.Загрузить(ПолучитьРасходы().Выгрузить());
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьРасходы()
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СУММА(РасходДенежныхСредствОбороты.СуммаОборот) КАК Сумма,
|	РасходДенежныхСредствОбороты.СтатьяРасходов.Родитель КАК СтатьяРасходов
|ИЗ
|	РегистрНакопления.РасходДенежныхСредств.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенежныхСредствОбороты
|
|СГРУППИРОВАТЬ ПО
|	РасходДенежныхСредствОбороты.СтатьяРасходов.Родитель";
Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата()-2629743));
Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
Результат = Запрос.Выполнить();
Возврат Результат;
КонецФункции
