
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоИзЗапроса = ПолучитьРасходы().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(ДеревоИзЗапроса  , "Дерево");
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьРасходы()
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РасходДенежныхСредствОбороты.СуммаОборот) КАК Сумма,
	               |	РасходДенежныхСредствОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	РасходДенежныхСредствОбороты.СтатьяРасходов.Родитель КАК СтатьяРасходов
	               |ИЗ
	               |	РегистрНакопления.РасходДенежныхСредств.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенежныхСредствОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходДенежныхСредствОбороты.ФизическоеЛицо,
	               |	РасходДенежныхСредствОбороты.СтатьяРасходов.Родитель
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	ФизическоеЛицо";
Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(ТекущаяДата()));
Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДата()));
Результат = Запрос.Выполнить();
Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДеревоИзЗапроса = ПолучитьРасходы().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(ДеревоИзЗапроса  , "Дерево");

КонецПроцедуры
